app/models/concerns/current_cart.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-05-05 22:43:32.689469"], ["updated_at", "2018-05-05 22:43:32.689469"]]
---
    def set_cart
      @cart = Cart.find(session[:cart_id])
    rescue ActiveRecord::RecordNotFound
      @cart = Cart.create